package com.dms.guyiyao.ServiceTest;

import com.alibaba.fastjson.JSON;
import com.dms.guyiyao.service.ExportWord;
import com.dms.guyiyao.service.ITsBookDifferentService;
import org.junit.jupiter.api.Test;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;

import java.io.IOException;
import java.util.ArrayList;
import java.util.List;

@SpringBootTest
public class diffTest {
@Autowired
    ITsBookDifferentService differentService;
ExportWord exportWord;
    @Test
    public  void  test_1(){
        System.out.println(differentService.getDiff("002004002","孙真人千金方"));
    }
    @Test
    public  void test_2(){
        System.out.println(differentService);
    }
    @Test
    public void test_3() throws IOException {
//         String list="";
//        List<List<Object>> arr= JSON.parseObject(list,new ArrayList<ArrayList<Object>>().getClass());
//        exportWord.ExportWord_v2(null,arr);
    }

    public static void main(String[] args) {
String list="[\n" +
        "\t[0, \"备急千金要方(宋校版)\", \"大医精诚第二\", \"张湛曰：夫经方之难精，由来尚矣。今病有内同而外异，亦有内异而外同，故五脏六腑之盈虚，血脉荣卫之通塞，固非耳目之所察，必先诊候以审之。而寸口关尺，有浮沉弦紧之乱；腧穴流注，有高下浅深之差；肌肤筋骨，有厚薄刚柔之异。唯用心精微者，始可与言于兹矣。今以至精至微之事，求之于至粗至浅之思，其不殆哉!若盈而益之，虚而损之，通而彻之，塞而壅之，寒而冷之，热而温之，是重加其疾，而望其生，吾见其死矣。故医方卜筮，艺能之难精者也。既非神授，何以得其幽微？世有愚者，读方三年，便谓天下无病可治；及治病三年，乃知天下无方可用。故学者必须博极医源，精勤不倦，不得道听途说，而言医道已了，深自误哉！\", \"张湛曰：夫经方之难精，由来尚矣。今病有内同而外异，亦□□□而外同，故五脏六腑之盈虚，血脉荣卫之通塞，固非耳目□□□，必诊候以审之。脉有浮沉弦紧之乱；腧穴流注，有高下浅□□□；肌肤筋骨，有厚薄刚柔之异。唯用心精微者，始可言于兹□。□以至精至微之事，求之于至粗至浅之思，其不殆哉！若盈而益之，虚而损之，通而彻之，塞而拥之，寒而冷之，热而温之，是重其疾，而望其生，吾见其死矣。故医方卜筮，艺能之难精者也。既非神授，何以得其幽微？世有愚者，读方三年，便谓天下无病可治；及治病三年，乃知天下无方可疗。故学者必须博极医源，精勤不倦，不得道听途说，而言医道已了，深自误哉。\", \"新雕孙真人千金方\", \"精诚第二\", null, null],\n" +
        "\t[1, \"备急千金要方(宋校版)\", \"大医精诚第二\", \"张湛曰：夫经方之难精，由来尚矣。今病有内同而外异，亦有内异而外同，故五脏六腑之盈虚，血脉荣卫之通塞，固非耳目之所察，必先诊候以审之。而寸口关尺，有浮沉弦紧之乱；腧穴流注，有高下浅深之差；肌肤筋骨，有厚薄刚柔之异。唯用心精微者，始可与言于兹矣。今以至精至微之事，求之于至粗至浅之思，其不殆哉!若盈而益之，虚而损之，通而彻之，塞而壅之，寒而冷之，热而温之，是重加其疾，而望其生，吾见其死矣。故医方卜筮，艺能之难精者也。既非神授，何以得其幽微？世有愚者，读方三年，便谓天下无病可治；及治病三年，乃知天下无方可用。故学者必须博极医源，精勤不倦，不得道听途说，而言医道已了，深自误哉！\", \"张湛曰：夫经方之难精，由来尚矣。今病有内同而外异，亦□□□而外同，故五脏六腑之盈虚，血脉荣卫之通塞，固非耳目□□□，必诊候以审之。脉有浮沉弦紧之乱；腧穴流注，有高下浅□□□；肌肤筋骨，有厚薄刚柔之异。唯用心精微者，始可言于兹□。□以至精至微之事，求之于至粗至浅之思，其不殆哉！若盈而益之，虚而损之，通而彻之，塞而拥之，寒而冷之，热而温之，是重其疾，而望其生，吾见其死矣。故医方卜筮，艺能之难精者也。既非神授，何以得其幽微？世有愚者，读方三年，便谓天下无病可治；及治病三年，乃知天下无方可疗。故学者必须博极医源，精勤不倦，不得道听途说，而言医道已了，深自误哉。\", \"新雕孙真人千金方\", \"精诚第二\", null, null],\n" +
        "\t[2, \"备急千金要方(宋校版)\", \"大医精诚第二\", \"张湛曰：夫经方之难精，由来尚矣。今病有内同而外异，亦有内异而外同，故五脏六腑之盈虚，血脉荣卫之通塞，固非耳目之所察，必先诊候以审之。而寸口关尺，有浮沉弦紧之乱；腧穴流注，有高下浅深之差；肌肤筋骨，有厚薄刚柔之异。唯用心精微者，始可与言于兹矣。今以至精至微之事，求之于至粗至浅之思，其不殆哉!若盈而益之，虚而损之，通而彻之，塞而壅之，寒而冷之，热而温之，是重加其疾，而望其生，吾见其死矣。故医方卜筮，艺能之难精者也。既非神授，何以得其幽微？世有愚者，读方三年，便谓天下无病可治；及治病三年，乃知天下无方可用。故学者必须博极医源，精勤不倦，不得道听途说，而言医道已了，深自误哉！\", \"张湛曰：夫经方之难精，由来尚矣。今病有内同而外异，亦□□□而外同，故五脏六腑之盈虚，血脉荣卫之通塞，固非耳目□□□，必诊候以审之。脉有浮沉弦紧之乱；腧穴流注，有高下浅□□□；肌肤筋骨，有厚薄刚柔之异。唯用心精微者，始可言于兹□。□以至精至微之事，求之于至粗至浅之思，其不殆哉！若盈而益之，虚而损之，通而彻之，塞而拥之，寒而冷之，热而温之，是重其疾，而望其生，吾见其死矣。故医方卜筮，艺能之难精者也。既非神授，何以得其幽微？世有愚者，读方三年，便谓天下无病可治；及治病三年，乃知天下无方可疗。故学者必须博极医源，精勤不倦，不得道听途说，而言医道已了，深自误哉。\", \"新雕孙真人千金方\", \"精诚第二\", \"{\\\"content\\\":\\\"张湛曰：夫经方之难精，由来尚矣。今病有内同而外异，亦有内异而外同，故五脏六腑之盈虚，血脉荣卫之通塞，固非耳目之所察，必先诊候以审之。而寸口关尺，有浮沉弦紧之乱；腧穴流注，有高下浅深之差；肌肤筋骨，有厚薄刚柔之异。唯用心精微者，始可与言于兹矣。今以至精至微之事，求之于至粗至浅之思，其不殆哉!若盈而益之，虚而损之，通而彻之，塞而壅之，寒而冷之，热而温之，是重加其疾，而望其生，吾见其死矣。故医方卜筮，艺能之难精者也。既非神授，何以得其幽微？世有愚者，读方三年，便谓天下无病可治；及治病三年，乃知天下无方可用。故学者必须博极医源，精勤不倦，不得道听途说，而言医道已了，深自误哉！\\\\n\\\",\\\"labelCategories\\\":[{\\\"id\\\":0,\\\"text\\\":\\\"异文\\\",\\\"color\\\":\\\"#eac0a2\\\",\\\"borderColor\\\":\\\"#a38671\\\"}],\\\"labels\\\":[{\\\"id\\\":0,\\\"categoryId\\\":0,\\\"startIndex\\\":4,\\\"endIndex\\\":33}],\\\"connectionCategories\\\":[],\\\"connections\\\":[]}\", \"{\\\"content\\\":\\\"张湛曰：夫经方之难精，由来尚矣。今病有内同而外异，亦□□□而外同，故五脏六腑之盈虚，血脉荣卫之通塞，固非耳目□□□，必诊候以审之。脉有浮沉弦紧之乱；腧穴流注，有高下浅□□□；肌肤筋骨，有厚薄刚柔之异。唯用心精微者，始可言于兹□。□以至精至微之事，求之于至粗至浅之思，其不殆哉！若盈而益之，虚而损之，通而彻之，塞而拥之，寒而冷之，热而温之，是重其疾，而望其生，吾见其死矣。故医方卜筮，艺能之难精者也。既非神授，何以得其幽微？世有愚者，读方三年，便谓天下无病可治；及治病三年，乃知天下无方可疗。故学者必须博极医源，精勤不倦，不得道听途说，而言医道已了，深自误哉。\\\\n\\\",\\\"labelCategories\\\":[{\\\"id\\\":0,\\\"text\\\":\\\"异文\\\",\\\"color\\\":\\\"#eac0a2\\\",\\\"borderColor\\\":\\\"#a38671\\\"}],\\\"labels\\\":[{\\\"id\\\":0,\\\"categoryId\\\":0,\\\"startIndex\\\":4,\\\"endIndex\\\":15}],\\\"connectionCategories\\\":[],\\\"connections\\\":[]}\"]\n" +
        "]";
        String s = JSON.parseObject(list, String.class);
//        System.out.println(s);
//        System.out.println();
        List<List<Object>> arr= JSON.parseObject(s,new ArrayList<ArrayList<Object>>().getClass());
        System.out.println(arr.get(2));
    }
}